{"_id":{"$oid":"649caaca258b1ec661971574"},"Title":"The Dark Knight","Description":"The plot follows the vigilante Batman, police lieutenant James Gordon, and district attorney Harvey Dent, who form an alliance to dismantle organized crime in Gotham City. Their efforts are derailed by the Joker, an anarchistic mastermind who seeks to test how far Batman will go to save the city from chaos.","Genre":{"Name":"Action","Description":"Movies in the action genre are fast-paced and include a lot of action like fight scenes, chase scenes, and slow-motion shots."},"Director":{"Name":"Christopher Nolan","Bio":"Best known for his cerebral, often nonlinear, storytelling, acclaimed writer-director Christopher Nolan was born on July 30, 1970, in London, England. Over the course of 15 years of filmmaking, Nolan has gone from low-budget independent films to working on some of the biggest blockbusters ever made.","Birth":"1970"},"ImagePath":"https://m.media-amazon.com/images/I/91KkWf50SoL._AC_UF894,1000_QL80_.jpg","Featured":false,"RuntimeMins":"152"}
{"_id":{"$oid":"649cac5e258b1ec661971575"},"Title":"Pulp Fiction","Description":"The lives of two mob hitmen, a boxer, a gangster and his wife, and a pair of diner bandits intertwine in four tales of violence and redemption.","Genre":{"Name":"Crime","Description":"Crime film is a genre that revolves around the action of a criminal mastermind. A Crime film will often revolve around the criminal himself, chronicling his rise and fall."},"Director":{"Name":"Quentin Tarantino","Bio":"Quentin Jerome Tarantino was born in Knoxville, Tennessee. His father, Tony Tarantino, is an Italian-American actor and musician from New York, and his mother, Connie (McHugh), is a nurse from Tennessee. Quentin moved with his mother to Torrance, California, when he was four years old.","Birth":"1963"},"ImagePath":"https://m.media-amazon.com/images/M/MV5BNGNhMDIzZTUtNTBlZi00MTRlLWFjM2ItYzViMjE3YzI5MjljXkEyXkFqcGdeQXVyNzkwMjQ5NzM@._V1_.jpg","Featured":false,"RuntimeMins":"154"}
{"_id":{"$oid":"649cacf2258b1ec661971576"},"Title":"Arrival","Description":"A linguist works with the military to communicate with alien lifeforms after twelve mysterious spacecraft appear around the world.","Genre":{"Name":"Drama","Description":"The drama genre features stories with high stakes and many conflicts. They're plot-driven and demand that every character and scene move the story forward."},"Director":{"Name":"Denis Villeneuve","Bio":"Denis Villeneuve is a French Canadian film director and writer. He was born in 1967, in Trois-Rivières, Québec, Canada. He started his career as a filmmaker at the National Film Board of Canada. He is best known for his feature films Arrival (2016), Sicario (2015), Prisoners (2013), Enemy (2013), and Incendies (2010). He is married to Tanya Lapointe.","Birth":"1967"},"ImagePath":"https://m.media-amazon.com/images/I/91UusfCtQaL._AC_UF894,1000_QL80_.jpg","Featured":false,"RuntimeMins":"116"}
{"_id":{"$oid":"649cad73258b1ec661971577"},"Title":"Moonlight","Description":"A young African-American man grapples with his identity and sexuality while experiencing the everyday struggles of childhood, adolescence, and burgeoning adulthood.","Genre":{"Name":"Drama","Description":"The drama genre features stories with high stakes and many conflicts. They're plot-driven and demand that every character and scene move the story forward."},"Director":{"Name":"Barry Jenkins","Bio":"Barry Jenkins was born on 19 November 1979 in Miami, Florida, USA. He is a producer and director, known for If Beale Street Could Talk (2018), Moonlight (2016) and Aftersun (2022).","Birth":"1979"},"ImagePath":"https://m.media-amazon.com/images/M/MV5BNzQxNTIyODAxMV5BMl5BanBnXkFtZTgwNzQyMDA3OTE@._V1_.jpg","Featured":false,"RuntimeMins":"111"}
{"_id":{"$oid":"649cae16258b1ec661971578"},"Title":"Manchester by the Sea","Description":"A depressed uncle is asked to take care of his teenage nephew after the boy's father dies.","Genre":{"Name":"Drama","Description":"The drama genre features stories with high stakes and many conflicts. They're plot-driven and demand that every character and scene move the story forward."},"Director":{"Name":"Kenneth Lonergan","Bio":"Kenneth Lonergan is a playwright, screenwriter and director. His film, You Can Count on Me (2000), which he wrote and directed, was nominated for an Academy Award for Best Screenplay, won the Sundance 2000 Grand Jury Prize and the Waldo Salt Screenwriting Award, the NY Film Critics Circle, LA Film Critics Circle, Writers Guild of America and National Board of Review awards for Best Screenplay of 2001, the AFI awards for Best Film and Best New Writer.","Birth":"1962"},"ImagePath":"https://m.media-amazon.com/images/M/MV5BMTYxMjk0NDg4Ml5BMl5BanBnXkFtZTgwODcyNjA5OTE@._V1_.jpg","Featured":false,"RuntimeMins":"137"}
{"_id":{"$oid":"649cb1bb258b1ec661971579"},"Title":"Star Wars Episode III - Revenge of the Sith","Description":"Three years into the Clone Wars, Obi-Wan pursues a new threat, while Anakin is lured by Chancellor Palpatine into a sinister plot to rule the galaxy.","Genre":{"Name":"Action","Description":"Movies in the action genre are fast-paced and include a lot of action like fight scenes, chase scenes, and slow-motion shots."},"Director":{"Name":"George Lucas","Bio":"George Walton Lucas, Jr. was raised on a walnut ranch in Modesto, California. His father was a stationery store owner and he had three siblings. During his late teen years, he went to Thomas Downey High School and was very much interested in drag racing. He planned to become a professional racecar driver. However, a terrible car accident just after his high school graduation ended that dream permanently. The accident changed his views on life.","Birth":"1944"},"ImagePath":"https://m.media-amazon.com/images/M/MV5BNTc4MTc3NTQ5OF5BMl5BanBnXkFtZTcwOTg0NjI4NA@@._V1_FMjpg_UX1000_.jpg","Featured":false,"RuntimeMins":"140"}
{"_id":{"$oid":"649cb256258b1ec66197157a"},"Title":"Harry Potter and the Goblet of Fire","Description":"Harry Potter finds himself competing in a hazardous tournament between rival schools of magic, but he is distracted by recurring nightmares.","Genre":{"Name":"Adventure","Description":"Adventure film is a genre that revolves around the conquests and explorations of a protagonist. The purpose of the conquest can be to retrieve a person or treasure, but often the main focus is simply the pursuit of the unknown."},"Director":{"Name":"Mike Newell","Bio":"Attended Cambridge University. Three year training course at Granada Television, with intention of going into theatre. Graduated to directing TV plays, building strong reputation for work with David Hare, David Edgar, Hohn, John Osborne, Jack Rosenthal.","Birth":"1942"},"ImagePath":"https://m.media-amazon.com/images/M/MV5BMTI1NDMyMjExOF5BMl5BanBnXkFtZTcwOTc4MjQzMQ@@._V1_FMjpg_UX1000_.jpg","Featured":false,"RuntimeMins":"157"}
{"_id":{"$oid":"649cb2ca258b1ec66197157b"},"Title":"Anchorman: The Legend of Ron Burgundy","Description":"In the 1970s, an anchorman's stint as San Diego's top-rated newsreader is challenged when an ambitious newswoman becomes his co-anchor.","Genre":{"Name":"Comedy","Description":"A comedy film is a category of film which emphasizes on humor. These films are designed to make the audience laugh in amusement."},"Director":{"Name":"Adam McKay","Bio":"Adam McKay (born April 17, 1968) is an American screenwriter, director, comedian, and actor. McKay has a comedy partnership with Will Ferrell, with whom he co-wrote the films Anchorman, Talladega Nights, and The Other Guys. Ferrell and McKay also founded their comedy website Funny or Die through their production company Gary Sanchez Productions. He has been married to Shira Piven since 1999. They have two children.","Birth":"1968"},"ImagePath":"https://m.media-amazon.com/images/I/51gbWRaL0IL._AC_UF894,1000_QL80_.jpg","Featured":false,"RuntimeMins":"94"}
{"_id":{"$oid":"649cb346258b1ec66197157c"},"Title":"Elf","Description":"Raised as an oversized elf, Buddy travels from the North Pole to New York City to meet his biological father, Walter Hobbs, who doesn't know he exists and is in desperate need of some Christmas spirit.","Genre":{"Name":"Comedy","Description":"A comedy film is a category of film which emphasizes on humor. These films are designed to make the audience laugh in amusement."},"Director":{"Name":"Jon Favreau","Bio":"Jon Favreau has progressed to strong mainstream visibility into the millennium and, after nearly two decades in the business, is still enjoying character stardom as well as earning notice as a writer/producer/director.","Birth":"1966"},"ImagePath":"https://m.media-amazon.com/images/M/MV5BMzUxNzkzMzQtYjIxZC00NzU0LThkYTQtZjNhNTljMTA1MDA1L2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMTMxODk2OTU@._V1_.jpg","Featured":false,"RuntimeMins":"97"}
{"_id":{"$oid":"649cb3bd258b1ec66197157d"},"Title":"Men in Black","Description":"A police officer joins a secret organization that polices and monitors extraterrestrial interactions on Earth.","Genre":{"Name":"Action","Description":"Movies in the action genre are fast-paced and include a lot of action like fight scenes, chase scenes, and slow-motion shots."},"Director":{"Name":"Barry Sonnenfeld","Bio":"Barry Sonnenfeld was born and raised in New York City. He graduated from New York University Film School in 1978. He started work as director of photography on the Oscar-nominated In Our Water (1982). Then Joel Coen and Ethan Coen hired him for Blood Simple (1984). This film began his collaboration with the Coen Bros., who used him for their next two pictures, Raising Arizona (1987) and Miller's Crossing (1990).","Birth":"1966"},"ImagePath":"https://m.media-amazon.com/images/M/MV5BMzUxNzkzMzQtYjIxZC00NzU0LThkYTQtZjNhNTljMTA1MDA1L2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMTMxODk2OTU@._V1_.jpg","Featured":false,"RuntimeMins":"98"}
{"_id":{"$oid":"649cb480258b1ec66197157e"},"Title":"Iron Man","Description":"After being held captive in an Afghan cave, billionaire engineer Tony Stark creates a unique weaponized suit of armor to fight evil.","Genre":{"Name":"Action","Description":"Movies in the action genre are fast-paced and include a lot of action like fight scenes, chase scenes, and slow-motion shots."},"Director":{"Name":"Jon Favreau","Bio":"Jon Favreau has progressed to strong mainstream visibility into the millennium and, after nearly two decades in the business, is still enjoying character stardom as well as earning notice as a writer/producer/director.","Birth":"1966"},"ImagePath":"https://m.media-amazon.com/images/I/41W6U03Kr4L.jpg","Featured":false,"RuntimeMins":"126"}
